Revit 2024 API
FluidTemperatureSetIterator Class
 An iterator to a set of FluidTemperature from FluidType.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class FluidTemperatureSetIterator : IEnumerator<FluidTemperature>
Visual Basic
Public Class FluidTemperatureSetIterator _
	Implements IEnumerator(Of FluidTemperature)
Visual C++
public ref class FluidTemperatureSetIterator : IEnumerator<FluidTemperature^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator
See Also
FluidTemperatureSetIterator Members
Autodesk.Revit.DB.Plumbing Namespace